[
  {
    "id": 1,
    "name": "iPhone 14 Pro Max",
    "details": "iPhone 14 Pro Max mobile was launched on 7th September 2022. The phone comes with a 120 Hz refresh rate 6.70-inch touchscreen display offering a resolution of 2796x1290 pixels at a pixel density of 460 pixels per inch (ppi). The display sports Other for protection. iPhone 14 Pro Max is powered by a hexa-core Apple A16 Bionic processor. The iPhone 14 Pro Max supports wireless charging, as well as proprietary fast charging.",
    "img": "https://i.ibb.co/NtxDMgb/iphone-14-promax.webp",
    "price": 1099
  },
  {
    "id": 2,
    "name": "iPhone 14 Pro",
    "details": "Apple has really nailed its smartphone formula. The iPhone 14 Pro features a lot of camera upgrades and the Dynamic Island, which replaces the infamous notch five years after the its debut on the iPhone X. I can confidently say that the iPhone 14 Pro is the best phone I’ve ever used, though I'm disappointed by the battery life. At $100 more, the iPhone 14 Pro Max does checks all of the boxes, including stellar battery life.",
    "img": "https://i.ibb.co/SQjWjwb/iphone-14-pro.webp",
    "price": 999
  },
  {
    "id": 3,
    "name": "iPhone 13 Pro Max",
    "details": "The iPhone 13 Pro Max is Apple's biggest iPhone, but it doens't have any advantages over the iPhone 13 Pro in terms of features, unlike in previous generations. It's heavy and unwieldy, but the big display is great for games and the increased battery capacity allows for nearly two full days of regular use. The display gets a 120Hz refresh rate, but there's still an unsightly notch that interferes with movies.",
    "img": "https://i.ibb.co/qCV81xM/iphone-13-promax.webp",
    "price": 1099
  },
  {
    "id": 4,
    "name": "iPhone 12 Pro Max",
    "details": "The phone which is powered by the new Apple A14 Bionic processor, comes with a 6.7 inche Super Retina XDR OLED capacitive touchscreen and 2778 x 1284 p resolution. It features an HDR display and True Tone, and Wide color (P3) gamut. The display screen is protected by a unique ceramic shield and features 1200 nits max brightness, Dolby Vision, HDR10+ and 120Hz refresh rate.",
    "img": "https://i.ibb.co/xDJVBBt/iphone-12-promax.jpg",
    "price": 634.95
  },
  {
    "id": 5,
    "name": "iPhone 11 Pro Max",
    "details": "The iPhone 11 Pro Max debuted on September 10, 2019, at Apple's \"by innovation only\" event. It premiered alongside the budget-friendly iPhone 11 and the smaller 5.8-inch iPhone 11 Pro. The iPhone 11 Pro was available for preorder on September 13, 2019, and shipped the following week on September 20. The iPhone 11 Pro Max comes in four colors: gold, Space Gray, silver, and Midnight Green.",
    "img": "https://i.ibb.co/JzycdYL/iphone-11-promax.jpg",
    "price": 397.78
  }
]
